## Section 28.1
Build a command line application to calculate distance between 2 lat/long coordinates.

### Listing 28.1
- `locationDB`
- Details of `haversine` & supporting functions are not part of the point being made except:


### Listing 28.2
- `haversine` will work with coordinates that are not in a container/context.
```haskell
haversine (40.7776,-73.9691) (42.6054,-70.7829)
207.3909006336738
```

### Skipping ahead a bit
- However, when we look-up values in `locationDB` they will be in the context of `Maybe`.
```haskell
> Map.lookup "Arkham" locationDB
Just (42.6054,-70.7829)

> Map.lookup "Innsmouth" locationDB
Just (42.825,-70.815)
```
- And `haversine` can not work with data in a context
```haskell
haversine Just (42.6054,-70.7829) Just (42.825,-70.815)

  • Couldn't match expected type: (a0 -> Maybe a0) -> (a2, b1) -> t
                with actual type: Maybe (a1, b0)
  • The function ‘Just’ is applied to three value arguments,

-- Essentially "too many arguments"
```

### Listing 28.3

- You have a function `LatLong -> LatLong -> Double`
- But to work with the maybe values from `Map.lookup` you will need `Maybe LatLong -> Maybe LatLong -> Maybe Double`

### Listing 28.4

You could write a wrapper for `haversine` it is extra work and only handles one context (`Maybe` in this case).

## Section 28.1.1

```haskell
(<$>) ::     Functor f =>   (a -> b) -> f a -> f b
(<*>) :: Applicative f => f (a -> b) -> f a -> f b
```

- `fmap` can only take one argument
- `fmap` can not work with a function that is in context
```haskell
> (+1) <$> (Just 2)
Just 3

> (+) <$> (Just 2) <$> (Just 2)
Couldn't match expected type: a1 -> b
            with actual type: Maybe (a0 -> a0) -- [A]

> :t (+) <$> (Just 2)
(+) <$> (Just 2) :: Num a => Maybe (a -> a)    -- [A]
```

[A]  Note `Maybe (a -> a)` in both cases.

## Section 28.2

### Listing 28.5
- Basically what I already showed

## Section 28.2.1

- A function in a context
```haskell
maybeInc :: Maybe (Integer -> Integer)
maybeInc = (+) <$> Just 1
```



## Section 28.2.2
```haskell
> startingCity = Map.lookup "Carcosa" locationDB
> destCity = Map.lookup "Innsmouth" locationDB

> haversine <$> startingCity <*> destCity
Just 1415.7942372467567

-- you can see the partial function in context here:
> :t haversine <$> startingCity
haversine <$> startingCity :: Maybe (LatLong -> Double)
```

```haskell
fn a b c <$> Just 1 <*> Just 2 <*> Just 3

pure :: a -> a b
```